Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFK124.atdf
      <value-group caption="Receive Buffer Overflow Interrupt Enable bit" name="C2INT__RBOVIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="System Error Interrupt Enable bit" name="C2INT__SERRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Enable bit" name="C2INT__CERRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Activity Wake-up Interrupt Enable bit" name="C2INT__WAKIE">
         <value caption="Interrupt request is enabled" name="" value="0x1"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Invalid Message Received Interrupt Enable bit" name="C2INT__IVRIE">
         <value caption="Interrupt request is enabled" name="" value="0x1L"/>
         <value caption="Interrupt request is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Code bits" name="C1VEC__ICODE">
         <value caption="Reserved" name="" value="1001000-1111111"/>
         <value caption="Invalid message received (IVRIF)" name="" value="0x48"/>
         <value caption="CAN module mode change (MODIF)" name="" value="0x47"/>
         <value caption="CAN timestamp timer (CTMRIF)" name="" value="0x46"/>
         <value caption="Bus bandwidth error (SERRIF)" name="" value="0x45"/>
         <value caption="Address error interrupt (SERRIF)" name="" value="0x44"/>
         <value caption="Receive FIFO overflow interrupt (RBOVIF)" name="" value="0x43"/>
         <value caption="Wake-up interrupt (WAKIF)" name="" value="0x42"/>
         <value caption="Error Interrupt (CERRIF)" name="" value="0x41"/>
         <value caption="No interrupt" name="" value="0x40"/>
         <value caption="Reserved" name="" value="0100000-0111111"/>
         <value caption="FIFO31 Interrupt (CiFSTAT set)" name="" value="0x1f"/>
         <value caption="FIFO30 Interrupt (CiFSTAT set)" name="" value="0x1e"/>
         <value caption="FIFO1 Interrupt (CiFSTAT set)" name="" value="0x1"/>
         <value caption="FIFO0 Interrupt (CiFSTAT set)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter Hit Number bit" name="C1VEC__FILHIT">
         <value caption="Filter 31" name="" value="0x1f"/>
         <value caption="Filter 30" name="" value="0x1e"/>
         <value caption="Filter 1" name="" value="0x1"/>
         <value caption="Filter 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Code bits" name="C2VEC__ICODE">
         <value caption="Reserved" name="" value="1001000-1111111"/>
         <value caption="Invalid message received (IVRIF)" name="" value="0x48"/>
         <value caption="CAN module mode change (MODIF)" name="" value="0x47"/>
         <value caption="CAN timestamp timer (CTMRIF)" name="" value="0x46"/>
         <value caption="Bus bandwidth error (SERRIF)" name="" value="0x45"/>
         <value caption="Address error interrupt (SERRIF)" name="" value="0x44"/>
         <value caption="Receive FIFO overflow interrupt (RBOVIF)" name="" value="0x43"/>
         <value caption="Wake-up interrupt (WAKIF)" name="" value="0x42"/>
         <value caption="Error Interrupt (CERRIF)" name="" value="0x41"/>
         <value caption="No interrupt" name="" value="0x40"/>
         <value caption="Reserved" name="" value="0100000-0111111"/>
         <value caption="FIFO31 Interrupt (CiFSTAT set)" name="" value="0x1f"/>
         <value caption="FIFO30 Interrupt (CiFSTAT set)" name="" value="0x1e"/>
         <value caption="FIFO1 Interrupt (CiFSTAT set)" name="" value="0x1"/>
         <value caption="FIFO0 Interrupt (CiFSTAT set)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter Hit Number bit" name="C2VEC__FILHIT">
         <value caption="Filter 31" name="" value="0x1f"/>
         <value caption="Filter 30" name="" value="0x1e"/>
         <value caption="Filter 1" name="" value="0x1"/>
         <value caption="Filter 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFOx Interrupt Pending bits" name="C1FSTAT__FIFOIP">
         <value caption="One or more enabled FIFO interrupts are pending" name="" value="0x1"/>
         <value caption="No FIFO interrupts are pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFOx Interrupt Pending bits" name="C2FSTAT__FIFOIP">
         <value caption="One or more enabled FIFO interrupts are pending" name="" value="0x1"/>
         <value caption="No FIFO interrupts are pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFOx Receive Overflow Interrupt Pending bit" name="C1RXOVF__RXOVF">
         <value caption="FIFO has overflowed" name="" value="0x1"/>
         <value caption="FIFO has not overflowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFOx Receive Overflow Interrupt Pending bit" name="C2RXOVF__RXOVF">
         <value caption="FIFO has overflowed" name="" value="0x1"/>
         <value caption="FIFO has not overflowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Time Stamp Timer Prescaler bits" name="C1TMR__CANTSPRE">
         <value caption="CAN time stamp timer (CANTS) increments every 65,535 system clocks" name="" value="0xffffffffL"/>
         <value caption="CAN time stamp timer (CANTS) increments every system clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Time Stamp Timer Prescaler bits" name="C2TMR__CANTSPRE">
         <value caption="CAN time stamp timer (CANTS) increments every 65,535 system clocks" name="" value="0xffffffffL"/>
         <value caption="CAN time stamp timer (CANTS) increments every system clock" name="" value="0x0"/>
      </value-group>
