Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFK124.atdf
      <value-group caption="Standard Identifier bits" name="C1RXF26__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF26__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF26__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF26__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF27__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF27__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF27__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF27__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF27__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF27__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF28__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF28__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF28__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF28__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF28__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF28__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF29__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF29__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF29__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF29__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF29__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF29__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF30__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1"/>
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF30__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1"/>
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0"/>
      </value-group>
