Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFK124.atdf
      <value-group caption="MIPS MCU ASE Implemented bit" name="Config3__MCU">
         <value caption="MCU ASE is implemented" name="" value="0x1"/>
      </value-group>
      <value-group caption="microMIPS Architecture Revision Level bits" name="Config3__MMAR">
         <value caption="Release 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Width of the Status IPL and Cause RIPL bits" name="Config3__IPLW">
         <value caption="IPL and RIPL bits are 8-bits in width" name="" value="0x1"/>
      </value-group>
      <value-group caption="Nested Fault bit" name="Config5__NF">
         <value caption="Nested Fault feature is implemented" name="" value="0x1"/>
      </value-group>
      <value-group caption="Wait IE Ignore bit" name="Config7__WII">
         <value caption="Indicates that this processor will allow an interrupt to unblock a WAIT instruction" name="" value="0x1L"/>
      </value-group>
      <value-group caption="Single-precision Floating Point Data bit" name="FIR__S">
         <value caption="Single-precision floating point data types are implemented" name="" value="0x1"/>
         <value caption="Single-precision floating point data types are not implemented" name="" value="0x0"/>
      </value-group>
      <value-group caption="Double-precision Floating Point Data bit" name="FIR__D">
         <value caption="Double-precision floating point data types are implemented" name="" value="0x1"/>
         <value caption="Double-precision floating point data types are not implemented" name="" value="0x0"/>
      </value-group>
      <value-group caption="Paired Single Floating Point data bit" name="FIR__PS">
         <value caption="PS floating point is implemented" name="" value="0x1"/>
         <value caption="PS floating point is not implemented" name="" value="0x0"/>
      </value-group>
      <value-group caption="Word Fixed Point data type bit" name="FIR__W">
         <value caption="Word fixed point data types are implemented" name="" value="0x1"/>
         <value caption="Word fixed point data types are not implemented" name="" value="0x0"/>
      </value-group>
      <value-group caption="Long Fixed Point Data Type bit" name="FIR__L">
         <value caption="Long fixed point data types are implemented" name="" value="0x1"/>
         <value caption="Long fixed point data types are not implemented" name="" value="0x0"/>
      </value-group>
      <value-group caption="64-bit FPU bit" name="FIR__F64">
         <value caption="This is a 64-bit FPU" name="" value="0x1"/>
         <value caption="This is not a 64-bit FPU" name="" value="0x0"/>
      </value-group>
      <value-group caption="IEEE-754-2008 bit" name="FIR__Has2008">
         <value caption="MAC2008, ABS2008, NAN2008 bits exist within the FCSR register" name="" value="0x1"/>
         <value caption="MAC2009, ABS2008, and NAN2008 bits do not exist within the FCSR register" name="" value="0x0"/>
      </value-group>
      <value-group caption="Full Convert Ranges bit" name="FIR__FC">
         <value caption="Full convert ranges are implemented (all numbers can be converted to another type by the FPU)" name="" value="0x1"/>
         <value caption="Full convert ranges are not implemented" name="" value="0x0"/>
      </value-group>
      <value-group caption="User Mode FR Switching Instruction bit" name="FIR__UFRP">
         <value caption="User mode FR switching instructions are supported" name="" value="0x1"/>
         <value caption="User mode FR switching instructions are not supported" name="" value="0x0"/>
      </value-group>
      <value-group caption="Rounding Mode control bits" name="FENR__RM">
         <value caption="Round towards Minus Infinity (-?)" name="" value="0x3"/>
         <value caption="Round towards Plus Infinity (+?)" name="" value="0x2"/>
         <value caption="Round toward Zero (0)" name="" value="0x1"/>
         <value caption="Round to Nearest" name="" value="0x0"/>
      </value-group>
      <value-group caption="Flush to Zero control bit" name="FENR__FS">
         <value caption="Denormal input operands are flushed to zero. Tiny results are flushed to either zero or the applied format's smallest normalized number (MinNorm) depending on the rounding mode settings." name="" value="0x1"/>
         <value caption="Denormal input operands result in an Unimplemented Operation exception." name="" value="0x0"/>
      </value-group>
      <value-group caption="Rounding Mode control bits" name="FCSR__RM">
         <value caption="Round towards Minus Infinity (-?)" name="" value="0x3"/>
         <value caption="Round towards Plus Infinity (+?)" name="" value="0x2"/>
         <value caption="Round toward Zero (0)" name="" value="0x1"/>
         <value caption="Round to Nearest" name="" value="0x0"/>
      </value-group>
      <value-group caption="NaN Encoding control bit" name="FCSR__NAN2008">
         <value caption="Quiet and signaling NaN encodings recommended by the IEEE Standard 754-2008. A quiet NaN is encoded with the first bit of the fraction being 1 and a signaling NaN is encoded with the first bit of the fraction being 0." name="" value="0x1"/>
      </value-group>
      <value-group caption="Absolute value format control bit" name="FCSR__ABS2008">
         <value caption="ABS.fmt and NEG.fmt instructions compliant with IEEE Standard 754-2008. The ABS and NEG functions accept QNAN inputs without trapping." name="" value="0x1"/>
      </value-group>
      <value-group caption="Fused Multiply Add mode control bit" name="FCSR__MAC2008">
         <value caption="Unfused multiply-add. Intermediary multiplication results are rounded to the destination format." name="" value="0x0"/>
      </value-group>
      <value-group caption="Flush to Nearest Control bit" name="FCSR__FN">
         <value caption="Final result is rounded to either zero or 2E_min (MinNorm), whichever is closest when in Round to Nearest (RN) rounding mode. For other rounding modes, a final result is given as if FS was set to 1." name="" value="0x1"/>
         <value caption="Handling of Tiny Result values depends on setting of the FS bit." name="" value="0x0"/>
      </value-group>
      <value-group caption="Flush Override Control bit" name="FCSR__FO">
         <value caption="The intermediate result is kept in an internal format, which can be perceived as having the usual mantissa precision but with unlimited exponent precision and without forcing to a specific value or taking an exception." name="" value="0x1"/>
         <value caption="Handling of Tiny Result values depends on setting of the FS bit." name="" value="0x0"/>
      </value-group>
      <value-group caption="Flush to Zero control bit" name="FCSR__FS">
         <value caption="Denormal input operands are flushed to zero. Tiny results are flushed to either zero or the applied format's smallest normalized number (MinNorm) depending on the rounding mode settings." name="" value="0x1"/>
         <value caption="Denormal input operands result in an Unimplemented Operation exception." name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="02823" name="CRU" version="2">
      <register-group name="CRU">
         <register caption="Oscillator Control Register" name="OSCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Oscillator Switch Enable bit" mask="0x00000001" name="OSWEN" values="OSCCON__OSWEN"/>
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x00000002" name="SOSCEN" values="OSCCON__SOSCEN"/>
            <bitfield mask="0x00000004" name="UFRCEN"/>
            <bitfield caption="Clock Fail Detect bit" mask="0x00000008" name="CF" values="OSCCON__CF"/>
            <bitfield caption="Sleep Mode Enable bit" mask="0x00000010" name="SLPEN" values="OSCCON__SLPEN"/>
            <bitfield caption="Clock Selection Lock Enable bit" mask="0x00000080" name="CLKLOCK" values="OSCCON__CLKLOCK"/>
            <bitfield caption="New Oscillator Selection bits" mask="0x00000700" name="NOSC" values="OSCCON__NOSC"/>
            <bitfield caption="Current Oscillator Selection bits" mask="0x00007000" name="COSC" values="OSCCON__COSC"/>
            <bitfield caption="Sleep 2-speed Startup Control bit" mask="0x00200000" name="SLP2SPD" values="OSCCON__SLP2SPD"/>
            <bitfield caption="Dream Mode Enable bit" mask="0x00800000" name="DRMEN" values="OSCCON__DRMEN"/>
            <bitfield caption="Internal Fast RC Oscillator Clock Divider bits" mask="0x07000000" name="FRCDIV" values="OSCCON__FRCDIV"/>
         </register>
